# Задание 9

library(car)

# 9.1.	Для данных из файла данные.xls проверьте гипотезы (используйте непараметрические тесты):

#Распределяем больных и здоровых на отдельные столбцы
df <- read.table('8/data.rd', encoding = "UTF-8")
healthy <- df[grepl('c', df$Nn),]
ill <- df[!grepl('c', df$Nn),]
median(healthy$C.4 - ill$C.4)

# a.	Медиана C-4 не отличается для здоровых пациентов (Nn=c1-c60) и пациентов с диагнозом;
# b.	Медиана C-6 не отличается для здоровых пациентов (Nn=c1-c60) и пациентов с диагнозом;
# (ограничиваем больных размерностью 60, чтобы векторы были одинаковой длины)
wilcox.test(healthy$C.4, head(ill$C.4, 60), paired = TRUE)
wilcox.test(healthy$C.6, head(ill$C.6, 60), paired = TRUE, conf.int = TRUE)

# 9.2.	Можно ли считать данные нормально-распределёнными?
# Для ответа на вопрос используйте графические и формальные критерии.

#графические тесты
hist(ill$C.4)
densityPlot(healthy$C.4)
qqnorm(ill$C.6)
qqPlot(healthy$C.6, distribution = "norm")
library(vioplot)
vioplot(ill$C.4, healthy$C.4, col = "gold", names=c('ill', 'healthy'))
#формальные тесты
ks.test(healthy$C.4, "rnorm")
#Значение p-value < 2.2e-16, т.е. меньше порога 0.05,
#следовательно необходимо отвергнуть нулевую гипотезу и принять альтернативную.
#Распределение отличается от нормального.
shapiro.test(ill$C.6)
#Значение p-value меньше порога 0.05,
#следовательно нужно отвергнуть нулевую гипотезу.
#Нет оснований считать распределение нормальным.

# 9.3.	Какие тесты (параметрические или непараметрические) правомерно использовать
# для проверки гипотез о равенстве центральных тенденций данных?

# Критерий Х2 Пирсона (Проверка гипотезы о нормальном распределении генеральной совокупности ).
chisq.test(healthy$C.4, head(ill$C.4, 60))
chisq.test(healthy$C.6, head(ill$C.6, 60))
# Критерий Фишера (Сравнение дисперсий двух нормальных генеральных совокупностей).
var.test(healthy$C.4, head(ill$C.4, 60))
var.test(healthy$C.6, head(ill$C.6, 60))
# Критерий Стьюдента (Сравнение двух средних нормальных генеральных совокупностей, дисперсии которых неизвестны и одинаковы).
t.test(healthy$C.4, head(ill$C.4, 60))
t.test(healthy$C.6, head(ill$C.6, 60))
# Критерии Бартлетта и Кохрана (Сравнение нескольких дисперсий нормальных генеральных совокупностей по выборкам).
bartlett.test(list(healthy$C.4, head(ill$C.4, 60)))
bartlett.test(list(healthy$C.6, head(ill$C.6, 60)))

# 9.4.	Какое минимальное количество данных в каждой группе необходимо для следующих значений мощности (χ) и уровня значимости (α):
# a.	 χ=80%, α=5%;
# b.	χ=80%, α=1%;
# c.	χ=95%, α=5%?

# Здоровые
power.t.test(delta = 1, sd = sd(healthy$C.6), sig.level = 0.05, power = 0.8)
# n = 4.172927
power.t.test(delta = 1, sd = sd(healthy$C.6), sig.level = 0.01, power = 0.8)
# n = 6.252802
power.t.test(delta = 1, sd = sd(healthy$C.6), sig.level = 0.05, power = 0.95)
# n = 6.048543

# Больные
power.t.test(delta = 1, sd = sd(ill$C.4), sig.level = 0.05, power = 0.8)
# n = 67.66234
power.t.test(delta = 1, sd = sd(ill$C.4), sig.level = 0.01, power = 0.8)
# n = 100.9021
power.t.test(delta = 1, sd = sd(ill$C.4), sig.level = 0.05, power = 0.95)
# n = 111.38

